sdaiEndModelAccess(Sdai_instS*)
\details
Ends the access to the model.
\param model [in] A model to finish the access to.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiMX_RO - SDAI-model access read-only.
* sdaiMX_RW - SDAI-model access read-write.
* sdaiTR_RW - Transaction read-write.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "default", "ifc4");
...
model = sdaiAccessModel(model, sdaiRW);
sdaiEndModelAccess(model);